tutorials/2nrel5mw/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  application       windPlantSolverStatoil6MW;

  libs              ("libuserincompressibleLESModels.so"
                     "libuserfiniteVolume.so"
                    );


  startFrom         startTime;

  startTime         0.0;

  stopAt            endTime;

  endTime           22000.0;

  deltaT            0.02;

  writeControl      adjustableRunTime;

  writeInterval     100.0; 

  purgeWrite        0;

  writeFormat       binary;

  writePrecision    12;

  writeCompression  compressed;

  timeFormat        general;

  timePrecision     12;

  runTimeModifiable yes;

  adjustTimeStep    no;

  maxCo             0.75;

  maxDeltaT         25.0;

  functions
  {

//     #include "sliceDataInstantaneous"
//     #include "sliceDataMean"
//     #include "cloudpts"
//     #include "cloud_1D"
  }

// ************************************************************************* //

