tutorials/2nrel5mw/constant/ABLProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          ABLProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Properties of the pressure gradient-driven wind 
driveWindOn               false;
UWindSpeed                UWindSpeed [0 1 -1 0 0 0 0] 8.0;
UWindDir                  270.0;
hWind                     hWind [0 1 0 0 0 0 0] 90.0;
hWindWidth                hWindWidth [0 1 0 0 0 0 0] 20;
alpha                     0.9;

// Properties of the Coriolis force
planetaryRotationPeriod   24.0;
latitude                  42.2;

// Statistics gathering input
statisticsOn              true;
statisticsFrequency       5;
avgStartTime              17400;
corrStartTime             17600;

// ************************************************************************* //
