tutorials/2nrel5mw/constant/turbineArrayPropertiesFAST
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineArrayProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


turbine0
{
  refx  200.0;
  refy  250.0;
  refz  0.0;
  hubz  90.0;
}


turbine1
{
  refx  350.0;
  refy  250.0;
  refz  0.0;
  hubz  90.0;
}


general
{
  yawAngle                0.0;
  numberofBld             3;
  numberofBldPts          50;           
  rotorDiameter           126.4;
  epsilon                 5.0;
  smearRadius             13.1;
  effectiveRadiusFactor   1.21;
  pointInterpType         0;
}

