tutorials/2nrel5mw/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

U0                  (8.0 0.0 0.0);
p_rgh0               0.0;
T0                   285.0;
nuSgs0               0.0;
kappat0              0.0;
flm0                 2.56E-6;
fmm0                 1.00E-4;

qwall               (0.0 0.0 0.0);
Rwall               (0.0 0.0 0.0 0.0 0.0 0.0);
kappa                0.4;
z0                   0.0002;
betaM                15.0;
gammaM               4.9;
betaH                9.0;
gammaH               7.8;
alphaH               1.0;
heatingRate          0.0;


#inputMode           merge

// ************************************************************************* //

